{
  "referralTiers": [
    {
      "count": 1,
      "tier": "Bronze",
      "reward": "Bronze Member - Early Updates",
      "icon": "🥉"
    },
    {
      "count": 5,
      "tier": "Silver",
      "reward": "10% Discount Code",
      "icon": "🥈"
    },
    {
      "count": 10,
      "tier": "Gold",
      "reward": "20% Discount + Exclusive Merch",
      "icon": "🥇"
    },
    {
      "count": 25,
      "tier": "Platinum",
      "reward": "30% Discount + Premium Merch + Beta Access",
      "icon": "💎"
    }
  ],
  "rewardTiers": [
    {
      "id": "sticker-pack",
      "title": "PawMe Sticker Pack",
      "requiredPoints": 50,
      "reward": "Exclusive PawMe sticker collection featuring your favorite pet companion robot designs",
      "image": "/images/rewards/sticker-pack.jpg",
      "alt": "PawMe branded sticker pack with cute robot and pet designs",
      "data-ai-hint": "Colorful sticker pack with PawMe logo and pet-themed designs"
    },
    {
      "id": "pawme-tshirt",
      "title": "PawMe T-Shirt",
      "requiredPoints": 100,
      "reward": "Premium quality t-shirt with PawMe branding - Available in S, M, L, XL",
      "image": "/images/rewards/tshirt.jpg",
      "alt": "PawMe branded t-shirt in various sizes",
      "data-ai-hint": "High-quality cotton t-shirt with PawMe logo and pet companion design"
    },
    {
      "id": "pet-collar-tag",
      "title": "Pet Collar with PawMe Tag",
      "requiredPoints": 150,
      "reward": "Stylish pet collar with custom PawMe identification tag",
      "image": "/images/rewards/pet-collar.jpg",
      "alt": "Premium pet collar with PawMe branded tag",
      "data-ai-hint": "Durable pet collar with engraved PawMe tag"
    },
    {
      "id": "water-bowl",
      "title": "PawMe Smart Water Bowl",
      "requiredPoints": 200,
      "reward": "Stainless steel water bowl with PawMe branding and non-slip base",
      "image": "/images/rewards/water-bowl.jpg",
      "alt": "PawMe branded stainless steel water bowl",
      "data-ai-hint": "Modern stainless steel pet water bowl with PawMe logo"
    },
    {
      "id": "toy-bundle",
      "title": "Premium Pet Toy Bundle",
      "requiredPoints": 300,
      "reward": "Curated collection of premium pet toys including interactive puzzles and chew toys",
      "image": "/images/rewards/toy-bundle.jpg",
      "alt": "Collection of premium pet toys in PawMe packaging",
      "data-ai-hint": "Assorted premium pet toys including rope toys, balls, and interactive puzzles"
    },
    {
      "id": "early-bird-discount",
      "title": "20% Early Bird Discount",
      "requiredPoints": 400,
      "reward": "Exclusive 20% discount code for PawMe Kickstarter campaign - Save big on your pre-order!",
      "image": "/images/rewards/discount-20.jpg",
      "alt": "20% discount voucher for PawMe Kickstarter",
      "data-ai-hint": "Digital discount code card showing 20% off"
    },
    {
      "id": "beta-access",
      "title": "Beta Tester Access",
      "requiredPoints": 500,
      "reward": "Exclusive access to PawMe beta testing program - Be among the first to experience PawMe!",
      "image": "/images/rewards/beta-tester.jpg",
      "alt": "Beta tester badge and access credentials",
      "data-ai-hint": "Exclusive beta tester badge with early access privileges"
    },
    {
      "id": "vip-backer",
      "title": "VIP Kickstarter Backer",
      "requiredPoints": 750,
      "reward": "VIP Backer status with exclusive perks: Priority shipping, lifetime updates, and special recognition",
      "image": "/images/rewards/vip-backer.jpg",
      "alt": "VIP Kickstarter backer badge with premium benefits",
      "data-ai-hint": "Premium VIP badge with crown and special backer designation"
    }
  ],
  "vipConfig": {
    "totalSpots": 100
  }
}


Style: bright, clean studio product photo, soft natural lighting, minimal shadows, no text, no logo unless you add PawMe later.
1. Chewy Starter Treats Pouch 🦴
Prompt
		A bright flatlay product photo of a small resealable pouch of mixed dog and cat treats on a neutral light background. The pouch is semi-transparent kraft paper with a clear window showing assorted small biscuits and soft treats, some treats spilling out in front of the bag. Soft natural light from the top left, minimal shadows, modern pet brand aesthetic.
2. Eco Poop‑Bag Holder & Rolls 🌱
Prompt

Style: bright, clean studio product photo, soft natural lighting, minimal shadows, no text, no logo unless you add PawMe later.
1. Chewy Starter Treats Pouch 🦴
Prompt

Studio product photo of an eco-friendly dog poop-bag holder with a roll of green biodegradable bags. The small holder is clipped to a simple leather dog leash lying on a light beige background, with a few bags slightly unrolled for detail. Clean, minimalist composition, soft shadows, modern lifestyle feel.
3. Feather Teaser Wand For Cats 🪶
Prompt
		A cat feather teaser wand toy on a pastel lavender background. Long slim handle with a flexible cord and soft colorful feathers at the tip, with a little bell. Shot from above in a flatlay style, no cat visible, soft diffused lighting, plenty of empty space for UI overlay.
4. Plush Squeaky Friend 🧸
Prompt
		Studio product photo of a cute plush dog toy shaped like a friendly robot character, with stitched eyes and a small squeaker symbol on the belly. The toy is placed on a light cream background with subtle soft shadows. Colors are soft blues and purples to match a techy pet brand, high detail fabric texture.
5. Interactive Treat Ball Puzzle 🧠
Prompt
		Close-up product shot of a transparent interactive treat ball toy for dogs and cats on a smooth white surface. The ball is partially filled with small brown kibble pieces, with a few pieces scattered around it. Soft top light, gentle reflections on the plastic, clean and modern look.
6. Natural Jerky Treat Pack 🍗
Prompt
		Flatlay photo of a kraft paper pouch of natural dog jerky treats on a wooden or stone background. The pouch is open with several jerky strips arranged neatly in front, showing their texture. Colors are warm and appetizing, styled like an artisanal snack brand, no text on the packaging.
7. Aloe & Coconut Grooming Wipes 🧼
Prompt
		Studio product photo of a pack of pet grooming wipes lying on a light aqua background. The packet is white with simple icon-style illustrations of a dog and cat, and hints of aloe leaves and a coconut slice next to it. Soft, clean lighting, subtle reflections, hygienic and fresh vibe.
8. Snuffle Treasure Hunt Mat 🌿
Prompt
		Top-down photo of a colorful fleece dog snuffle mat laid out on a neutral background. The mat has many folded strips and pockets in greens and blues with a few small treats visible tucked inside. Bright, even lighting, high detail on the fabric, no dog in the frame.
9. Durable Tug & Fetch Rope 💪
Prompt
		Studio shot of a thick braided dog rope toy in bright teal and yellow, arranged in a loose loop on a light gray background. The rope ends are knotted with frayed tassels for texture. Sharp focus on the rope fibers, soft vignette, minimalistic composition.
10. Smart Laser Chase Toy 🔦
Prompt
		Product render of a compact automatic cat laser toy on a clean white tabletop. Small rounded gadget in matte white plastic with a single LED indicator, projecting a tiny red laser dot onto the surface in front. Slight futuristic feel to match a pet robot brand, soft ambient lighting.
11. Deluxe Variety Treat Box 🎁
Prompt
		Overhead flatlay of an open gift-style box filled with assorted pet treats: small biscuits, soft chews, fish-shaped treats, and a chew stick bundle. The box sits on a pastel background, with tissue paper and a few treats artfully scattered around the box. Bright, inviting, subscription-box aesthetic.
12. Custom Name Tag & Collar Set 👑
Prompt
		Close-up product photo of a premium leather pet collar with a metal buckle and a round engraved name tag, arranged in a gentle curve on a soft beige fabric background. The tag is brushed gold with a simple paw icon in the center, shiny but not reflective. Elegant, slightly luxurious mood.
13. PawMe Mini Celebration Box 🎉
Prompt
		Hero image of an open pet celebration box on a pastel gradient background. Inside are two colorful toys (one plush, one ball) and two full-size treat bags neatly arranged with crinkled paper filler. The scene is shot from a slight top-down angle, with confetti pieces lightly scattered around the box, bright and festive lighting.
These prompts can be pasted directly into your image generator; keep the style consistent (backgrounds, lighting) to make the rewards catalog feel cohesive in your PawMe dashboard.